<?php
$b19 = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9];
$b27 = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27];
$b18 = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18];
$bbd = ['大', '小', '单', '双'];

return [
    [
        'aliasName'  => '后三组三',
        'playId' => 33,
        'tags' => [
            ['nm' => '包号', 'sv' => $b19, 'vv' => $b19],
        ],
    ],

    [
        'aliasName'  => '后三组六',
        'playId' => 35,
        'tags' => [
            ['nm' => '包号', 'sv' => $b19, 'vv' => $b19],
        ],
    ],

    [
        'aliasName'  => '后三豹子',
        'playId' => 36,
        'tags' => [
            ['nm' => '豹子通选', 'sv' => ['豹子通选'], 'vv' => ['豹子通选']],
            ['nm' => '豹子单选', 'sv' => ['000', '111', '222', '333', '444', '555', '666', '777', '888', '999'], 'vv' => ['000', '111', '222', '333', '444', '555', '666', '777', '888', '999']],
        ],
    ],

    [
        'aliasName'  => '后三顺子',
        'playId' => 37,
        'tags' => [
            ['nm' => '顺子通选', 'sv' => ['顺子通选'], 'vv' => ['顺子通选']],
            ['nm' => '顺子单选', 'sv' => ['012', '123', '234', '345', '456', '567', '678', '789', '890', '901'], 'vv' => ['012', '123', '234', '345', '456', '567', '678', '789', '890', '901']],
        ],
    ],

    [
        'aliasName'  => '后三对子',
        'playId' => 38,
         'tags' => [
            ['nm' => '对子通选', 'sv' => ['对子通选'], 'vv' => ['对子通选']],
            ['nm' => '对子单选', 'sv' => ['00', '11', '22', '33', '44', '55', '66', '77', '88', '99'], 'vv' => ['00', '11', '22', '33', '44', '55', '66', '77', '88', '99']],
        ],
    ],

    [
        'aliasName'  => '后三和值',
        'playId' => 31,
        'tags' => [
            ['nm' => '和值', 'sv' => $b27, 'vv' => $b27],
        ],
    ],

    [
        'aliasName'  => '后三跨度',
        'playId' => 32,
        'tags' => [
            ['nm' => '跨度', 'sv' => $b19, 'vv' => $b19],
        ],
    ],

    [
        'aliasName'  => '前三组三',
        'playId' => 53,
        'tags' => [
            ['nm' => '包号', 'sv' => $b19, 'vv' => $b19],
        ],
    ],

    [
        'aliasName'  => '前三组六',
        'playId' => 55,
        'tags' => [
            ['nm' => '包号', 'sv' => $b19, 'vv' => $b19],
        ],
    ],

    [
        'aliasName'  => '前三豹子',
        'playId' => 56,
        'tags' => [
            ['nm' => '豹子通选', 'sv' => ['豹子通选'], 'vv' => ['豹子通选']],
            ['nm' => '豹子单选', 'sv' => ['000', '111', '222', '333', '444', '555', '666', '777', '888', '999'], 'vv' => ['000', '111', '222', '333', '444', '555', '666', '777', '888', '999']],
        ],
    ],

    [
        'aliasName'  => '前三顺子',
        'playId' => 57,
        'tags' => [
            ['nm' => '顺子通选', 'sv' => ['顺子通选'], 'vv' => ['顺子通选']],
            ['nm' => '顺子单选', 'sv' => ['012', '123', '234', '345', '456', '567', '678', '789', '890', '901'], 'vv' => ['012', '123', '234', '345', '456', '567', '678', '789', '890', '901']],
        ],
    ],

    [
        'aliasName'  => '前三对子',
        'playId' => 58,
        'tags' => [
            ['nm' => '对子通选', 'sv' => ['对子通选'], 'vv' => ['对子通选']],
            ['nm' => '对子单选', 'sv' => ['00', '11', '22', '33', '44', '55', '66', '77', '88', '99'], 'vv' => ['00', '11', '22', '33', '44', '55', '66', '77', '88', '99']],
        ],
    ],

    [
        'aliasName'  => '前三和值',
        'playId' => 51,
        'tags' => [
            ['nm' => '和值', 'sv' => $b27, 'vv' => $b27],
        ],
    ],

    [
        'aliasName'  => '前三跨度',
        'playId' => 52,
        'tags' => [
            ['nm' => '跨度', 'sv' => $b19, 'vv' => $b19],
        ],
    ],

    [
        'aliasName'  => '五字和',
        'playId' => 68,
        'tags' => [
            ['nm' => '和数', 'sv' => ['大', '小', '单', '双'], 'vv' => ['总数大', '总数小', '总数单', '总数双']],
            ['nm' => '和数尾', 'sv' => ['大', '小', '质', '合'], 'vv' => ['和尾数大', '和尾数小', '和尾数质', '和尾数合']],
        ],
    ],

    [
        'aliasName'  => '猜定位',
        'playId' => 69,
        'tags' => [
            ['nm' => '万位', 'sv' => $b19, 'vv' => $b19],
            ['nm' => '千位', 'sv' => $b19, 'vv' => $b19],
            ['nm' => '百位', 'sv' => $b19, 'vv' => $b19],
            ['nm' => '十位', 'sv' => $b19, 'vv' => $b19],
            ['nm' => '个位', 'sv' => $b19, 'vv' => $b19]
        ],
    ],

    [
        'aliasName'  => '后三一码',
        'playId' => 70,
        'tags' => [
            ['nm' => '不定位', 'sv' => $b19, 'vv' => $b19],
        ],
    ],

    [
        'aliasName'  => '后三二码',
        'playId' => 73,
        'tags' => [
            ['nm' => '不定位', 'sv' => $b19, 'vv' => $b19],
        ],
    ],

    [
        'aliasName'  => '后四一码',
        'playId' => 76,
        'tags' => [
            ['nm' => '不定位', 'sv' => $b19, 'vv' => $b19],
        ],
    ],

    [
        'aliasName'  => '后四二码',
        'playId' => 77,
        'tags' => [
            ['nm' => '不定位', 'sv' => $b19, 'vv' => $b19],
        ],
    ],

    [
        'aliasName'  => '五星二码',
        'playId' => 78,
        'tags' => [
            ['nm' => '不定位', 'sv' => $b19, 'vv' => $b19],
        ],
    ],

    [
        'aliasName'  => '五星三码',
        'playId' => 79,
        'tags' => [
            ['nm' => '不定位', 'sv' => $b19, 'vv' => $b19],
        ],
    ],

    [
        'aliasName'  => '单球',
        'playId' => 80,
        'tags' => [
            ['nm' => '万位', 'sv' => $bbd, 'vv' => $bbd],
            ['nm' => '千位', 'sv' => $bbd, 'vv' => $bbd],
            ['nm' => '百位', 'sv' => $bbd, 'vv' => $bbd],
            ['nm' => '十位', 'sv' => $bbd, 'vv' => $bbd],
            ['nm' => '个位', 'sv' => $bbd, 'vv' => $bbd]
        ],
    ],

    [
        'aliasName'  => '百家乐',
        'playId' => 10,
        'tags' => [
            ['nm' => '庄', 'sv' => ['庄','庄对子','庄豹子','庄天王'], 'vv' => ['庄','庄对子','庄豹子','庄天王']],
            ['nm' => '闲', 'sv' => ['闲','闲对子','闲豹子','闲天王'], 'vv' => ['闲','闲对子','闲豹子','闲天王']],
         ],
    ],

    [
        'aliasName'  => '一帆风顺',
        'playId' => 11,
        'tags' => [
            ['nm' => '一帆风顺', 'sv' => $b19, 'vv' => $b19],
        ],
    ],

    [
        'aliasName'  => '好事成双',
        'playId' => 12,
        'tags' => [
            ['nm' => '好事成双', 'sv' => $b19, 'vv' => $b19],
        ],
    ],

    [
        'aliasName'  => '三星报喜',
        'playId' => 13,
        'tags' => [
            ['nm' => '三星报喜', 'sv' => $b19, 'vv' => $b19],
        ],
    ],

    [
        'aliasName'  => '四季发财',
        'playId' => 14,
        'tags' => [
            ['nm' => '四季发财', 'sv' => $b19, 'vv' => $b19],
        ],
    ],
];