<?php
// $type = [''];
$b19 = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9];
$b27 = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27];
$b18 = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18];
$bbd = ['大', '小', '单', '双'];
global $app;
$ci = $app->getContainer();
//个位
$ge_wei   = $ci->lang->text('ge wei');
//十位
$shi_wei  = $ci->lang->text('shi wei');
$bai_wei  = $ci->lang->text('bai wei');
$qian_wei = $ci->lang->text('qian wei');
$wan_wei  = $ci->lang->text('wan wei');

//不定位
$no_positioning = $ci->lang->text('No positioning');
//标准
$std            = $ci->lang->text('state.std');
//1 - 150
return [
   
   /* 1 => [
            'name' => [$std, '五星直选','直选复式'],
            'tags' => [
                ['nm' => $wan_wei, 'sv' => $b19, 'vv' => $b19],
                ['nm' => $qian_wei, 'sv' => $b19, 'vv' => $b19],
                ['nm' => $bai_wei, 'sv' => $b19, 'vv' => $b19],
                ['nm' => $shi_wei, 'sv' => $b19, 'vv' => $b19],
                ['nm' => $ge_wei, 'sv' => $b19, 'vv' => $b19]
            ],
         ],

    2 => [
            'name' => [$std, '五星直选', '直选组合'],
            'tags' => [
                ['nm' => $wan_wei, 'sv' => $b19, 'vv' => $b19],
                ['nm' => $qian_wei, 'sv' => $b19, 'vv' => $b19],
                ['nm' => $bai_wei, 'sv' => $b19, 'vv' => $b19],
                ['nm' => $shi_wei, 'sv' => $b19, 'vv' => $b19],
                ['nm' => $ge_wei, 'sv' => $b19, 'vv' => $b19]
            ],
    ],

    3 => [
            'name' => [$std, '五星直选', '通选复式'],
            'tags' => [
                ['nm' => $wan_wei, 'sv' => $b19, 'vv' => $b19],
                ['nm' => $qian_wei, 'sv' => $b19, 'vv' => $b19],
                ['nm' => $bai_wei, 'sv' => $b19, 'vv' => $b19],
                ['nm' => $shi_wei, 'sv' => $b19, 'vv' => $b19],
                ['nm' => $ge_wei, 'sv' => $b19, 'vv' => $b19]
            ],
    ],

    4 => [
            'name' => [$std, '五星组选', '组选120'],
            'tags' => [
                ['nm' => '组选120', 'sv' => $b19, 'vv' => $b19],
            ],
    ],

    5 => [
            'name' => [$std, '五星组选', '组选60'],
            'tags' => [
                ['nm' => '二重号', 'sv' => $b19, 'vv' => $b19],
                ['nm' => '单号', 'sv' => $b19, 'vv' => $b19],
            ],
    ],

    6 => [
            'name' => [$std, '五星组选', '组选30'],
            'tags' => [
                ['nm' => '二重号', 'sv' => $b19, 'vv' => $b19],
                ['nm' => '单号', 'sv' => $b19, 'vv' => $b19],
            ],
    ],

    7 => [
            'name' => [$std, '五星组选', '组选20'],
            'tags' => [
                ['nm' => '三重号', 'sv' => $b19, 'vv' => $b19],
                ['nm' => '单号', 'sv' => $b19, 'vv' => $b19],
            ],
    ],

    8 => [
            'name' => [$std, '五星组选', '组选10'],
            'tags' => [
                ['nm' => '三重号', 'sv' => $b19, 'vv' => $b19],
                ['nm' => '二重号', 'sv' => $b19, 'vv' => $b19],
            ],
    ],

    9 => [
            'name' => [$std, '五星组选', '组选5'],
            'tags' => [
                ['nm' => '四重号', 'sv' => $b19, 'vv' => $b19],
                ['nm' => '单号', 'sv' => $b19, 'vv' => $b19],
            ],
    ],

    10 => [
            'name' => [$std, '五星特殊', '百家乐'],
            'tags' => [
                ['nm' => '庄', 'sv' => ['庄','庄对子','庄豹子','庄天王'], 'vv' => ['庄','庄对子','庄豹子','庄天王']],
                ['nm' => '闲', 'sv' => ['闲','闲对子','闲豹子','闲天王'], 'vv' => ['闲','闲对子','闲豹子','闲天王']],
            ],
    ],

    11 => [
            'name' => [$std, '五星特殊', '一帆风顺'],
            'tags' => [
                ['nm' => '一帆风顺', 'sv' => $b19, 'vv' => $b19],
            ],
    ],

    12 => [
            'name' => [$std, '五星特殊', '好事成双'],
            'tags' => [
                ['nm' => '好事成双', 'sv' => $b19, 'vv' => $b19],
            ],
    ],

    13 => [
            'name' => [$std, '五星特殊', '三星报喜'],
            'tags' => [
                ['nm' => '三星报喜', 'sv' => $b19, 'vv' => $b19],
            ],
    ],

    14 => [
            'name' => [$std, '五星特殊', '四季发财'],
            'tags' => [
                ['nm' => '四季发财', 'sv' => $b19, 'vv' => $b19],
            ],
    ],

    15 => [
            'name' => [$std, '四星直选', '后四复式'],
            'tags' => [
                ['nm' => $qian_wei, 'sv' => $b19, 'vv' => $b19],
                ['nm' => $bai_wei, 'sv' => $b19, 'vv' => $b19],
                ['nm' => $shi_wei, 'sv' => $b19, 'vv' => $b19],
                ['nm' => $ge_wei, 'sv' => $b19, 'vv' => $b19]
            ],
    ],

    16 => [
            'name' => [$std, '四星直选', '后四组合'],
            'tags' => [
                ['nm' => $qian_wei, 'sv' => $b19, 'vv' => $b19],
                ['nm' => $bai_wei, 'sv' => $b19, 'vv' => $b19],
                ['nm' => $shi_wei, 'sv' => $b19, 'vv' => $b19],
                ['nm' => $ge_wei, 'sv' => $b19, 'vv' => $b19]
            ],
    ],

    17 => [
            'name' => [$std, '四星直选', '前四复式'],
            'tags' => [
                ['nm' => $wan_wei, 'sv' => $b19, 'vv' => $b19],
                ['nm' => $qian_wei, 'sv' => $b19, 'vv' => $b19],
                ['nm' => $bai_wei, 'sv' => $b19, 'vv' => $b19],
                ['nm' => $shi_wei, 'sv' => $b19, 'vv' => $b19],
            ],
    ],

    18 => [
            'name' => [$std, '四星直选', '前四组合'],
            'tags' => [
                ['nm' => $wan_wei, 'sv' => $b19, 'vv' => $b19],
                ['nm' => $qian_wei, 'sv' => $b19, 'vv' => $b19],
                ['nm' => $bai_wei, 'sv' => $b19, 'vv' => $b19],
                ['nm' => $shi_wei, 'sv' => $b19, 'vv' => $b19],
            ],
    ],

    19 => [
            'name' => [$std, '四星组选', '后四组选24'],
            'tags' => [
                ['nm' => '四季发财', 'sv' => $b19, 'vv' => $b19],
            ],
    ],

    20 => [
            'name' => [$std, '四星组选', '后四组选12'],
            'tags' => [
                ['nm' => '二重号', 'sv' => $b19, 'vv' => $b19],
                ['nm' => '单号', 'sv' => $b19, 'vv' => $b19],
            ],
    ],

    22 => [
            'name' => [$std, '四星组选', '后四组选6'],
            'tags' => [
                ['nm' => '二重号', 'sv' => $b19, 'vv' => $b19],
            ],
    ],

    23 => [
            'name' => [$std, '四星组选', '后四组选4'],
            'tags' => [
                ['nm' => '三重号', 'sv' => $b19, 'vv' => $b19],
                ['nm' => '单号', 'sv' => $b19, 'vv' => $b19],
            ],
    ],

    24 => [
            'name' => [$std, '四星组选', '前四组选24'],
            'tags' => [
                ['nm' => '组选24', 'sv' => $b19, 'vv' => $b19],
            ],
    ],

    25 => [
            'name' => [$std, '四星组选', '前四组选12'],
            'tags' => [
                ['nm' => '二重号', 'sv' => $b19, 'vv' => $b19],
                ['nm' => '单号', 'sv' => $b19, 'vv' => $b19],
            ],
    ],

    26 => [
            'name' => [$std, '四星组选', '前四组选6'],
            'tags' => [
                ['nm' => '二重号', 'sv' => $b19, 'vv' => $b19],
            ],
    ],

    27 => [
            'name' => [$std, '四星组选', '前四组选4'],
            'tags' => [
                ['nm' => '三重号', 'sv' => $b19, 'vv' => $b19],
                ['nm' => '单号', 'sv' => $b19, 'vv' => $b19],
            ],
    ],*/

    28 => [
            'name' => [$std, '前三', '直选复式'],
            'tags' => [
                ['nm' => $bai_wei, 'sv' => $b19, 'vv' => $b19],
                ['nm' => $shi_wei, 'sv' => $b19, 'vv' => $b19],
                ['nm' => $ge_wei, 'sv' => $b19, 'vv' => $b19],
            ],
    ],
    /*
        29 => [
                'name' => [$std, '后三', '直选组合'],
                'tags' => [
                    ['nm' => $bai_wei, 'sv' => $b19, 'vv' => $b19],
                    ['nm' => $shi_wei, 'sv' => $b19, 'vv' => $b19],
                    ['nm' => $ge_wei, 'sv' => $b19, 'vv' => $b19],
                ],
        ],

        31 => [
                'name' => [$std, '后三', '直选和值'],
                'tags' => [
                    ['nm' => '和值', 'sv' => $b27, 'vv' => $b27],
                ],
        ],

        32 => [
                'name' => [$std, '后三', '直选跨度'],
                'tags' => [
                    ['nm' => '跨度', 'sv' => $b19, 'vv' => $b19],
                ],
        ],

        33 => [
                'name' => [$std, '后三', '组三包号'],
                'tags' => [
                    ['nm' => '包号', 'sv' => $b19, 'vv' => $b19],
                ],
        ],

        34 => [
                'name' => [$std, '后三', '组三直选'],
                'tags' => [
                    ['nm' => '二重号', 'sv' => $b19, 'vv' => $b19],
                    ['nm' => '单号', 'sv' => $b19, 'vv' => $b19],
                ],
        ],

        35 => [
                'name' => [$std, '后三', '组六包号'],
                'tags' => [
                    ['nm' => '包号', 'sv' => $b19, 'vv' => $b19],
                ],
        ],

        36 => [
                'name' => [$std, '后三', '后三豹子'],
                'tags' => [
                    ['nm' => '豹子通选', 'sv' => ['豹子通选'], 'vv' => ['豹子通选']],
                    ['nm' => '豹子单选', 'sv' => ['000', '111', '222', '333', '444', '555', '666', '777', '888', '999'], 'vv' => ['000', '111', '222', '333', '444', '555', '666', '777', '888', '999']],
                ],
        ],

        37 => [
                'name' => [$std, '后三', '后三顺子'],
                'tags' => [
                    ['nm' => '顺子通选', 'sv' => ['顺子通选'], 'vv' => ['顺子通选']],
                    ['nm' => '顺子单选', 'sv' => ['012', '123', '234', '345', '456', '567', '678', '789', '890', '901'], 'vv' => ['012', '123', '234', '345', '456', '567', '678', '789', '890', '901']],
                ],
        ],

        38 => [
                'name' => [$std, '后三', '后三对子'],
                'tags' => [
                    ['nm' => '对子通选', 'sv' => ['对子通选'], 'vv' => ['对子通选']],
                    ['nm' => '对子单选', 'sv' => ['00', '11', '22', '33', '44', '55', '66', '77', '88', '99'], 'vv' => ['00', '11', '22', '33', '44', '55', '66', '77', '88', '99']],
                ],
        ],

        39 => [
                'name' => [$std, '中三', '直选复式'],
                'tags' => [
                    ['nm' => $qian_wei, 'sv' => $b19, 'vv' => $b19],
                    ['nm' => $bai_wei, 'sv' => $b19, 'vv' => $b19],
                    ['nm' => $shi_wei, 'sv' => $b19, 'vv' => $b19],
                ],
        ],

        40 => [
                'name' => [$std, '中三', '直选组合'],
                'tags' => [
                    ['nm' => $qian_wei, 'sv' => $b19, 'vv' => $b19],
                    ['nm' => $bai_wei, 'sv' => $b19, 'vv' => $b19],
                    ['nm' => $shi_wei, 'sv' => $b19, 'vv' => $b19],
                ],
        ],

        41 => [
                'name' => [$std, '中三', '直选和值'],
                'tags' => [
                    ['nm' => '和值', 'sv' => $b27, 'vv' => $b27],
                ],
        ],

        42 => [
                'name' => [$std, '中三', '直选跨度'],
                'tags' => [
                    ['nm' => '跨度', 'sv' => $b19, 'vv' => $b19],
                ],
        ],

        43 => [
                'name' => [$std, '中三', '组三包号'],
                'tags' => [
                    ['nm' => '包号', 'sv' => $b19, 'vv' => $b19],
                ],
        ],

        44 => [
                'name' => [$std, '中三', '组三直选'],
                'tags' => [
                    ['nm' => '二重号', 'sv' => $b19, 'vv' => $b19],
                    ['nm' => '单号', 'sv' => $b19, 'vv' => $b19],
                ],
        ],

        45 => [
                'name' => [$std, '中三', '组六包号'],
                'tags' => [
                    ['nm' => '包号', 'sv' => $b19, 'vv' => $b19],
                ],
        ],

        46 => [
                'name' => [$std, '中三', '豹子'],
                'tags' => [
                    ['nm' => '豹子通选', 'sv' => ['豹子通选'], 'vv' => ['豹子通选']],
                    ['nm' => '豹子单选', 'sv' => ['000', '111', '222', '333', '444', '555', '666', '777', '888', '999'], 'vv' => ['000', '111', '222', '333', '444', '555', '666', '777', '888', '999']],
                ],
        ],

        47 => [
                'name' => [$std, '中三', '中三顺子'],
                'tags' => [
                    ['nm' => '顺子通选', 'sv' => ['顺子通选'], 'vv' => ['顺子通选']],
                    ['nm' => '顺子单选', 'sv' => ['012', '123', '234', '345', '456', '567', '678', '789', '890', '901'], 'vv' => ['012', '123', '234', '345', '456', '567', '678', '789', '890', '901']],
                ],
        ],

        48 => [
                'name' => [$std, '中三', '中三对子'],
                'tags' => [
                    ['nm' => '对子通选', 'sv' => ['对子通选'], 'vv' => ['对子通选']],
                    ['nm' => '对子单选', 'sv' => ['00', '11', '22', '33', '44', '55', '66', '77', '88', '99'], 'vv' => ['00', '11', '22', '33', '44', '55', '66', '77', '88', '99']],
                ],
        ],

    49 => [
            'name' => [$std, '前三', '直选复式'],
            'tags' => [
                ['nm' => $wan_wei, 'sv' => $b19, 'vv' => $b19],
                ['nm' => $qian_wei, 'sv' => $b19, 'vv' => $b19],
                ['nm' => $bai_wei, 'sv' => $b19, 'vv' => $b19],
            ],
    ],*/

    /*50 => [
            'name' => [$std, '前三', '直选组合'],
            'tags' => [
                ['nm' => $wan_wei, 'sv' => $b19, 'vv' => $b19],
                ['nm' => $qian_wei, 'sv' => $b19, 'vv' => $b19],
                ['nm' => $bai_wei, 'sv' => $b19, 'vv' => $b19],
            ],
    ],

    51 => [
            'name' => [$std, '前三', '直选和值'],
            'tags' => [
                ['nm' => '和值', 'sv' => $b27, 'vv' => $b27],
            ],
    ],

    52 => [
            'name' => [$std, '前三', '直选跨度'],
            'tags' => [
                ['nm' => '跨度', 'sv' => $b19, 'vv' => $b19],
            ],
    ],

    53 => [
            'name' => [$std, '前三', '组三包号'],
            'tags' => [
                ['nm' => '包号', 'sv' => $b19, 'vv' => $b19],
            ],
    ],

    54 => [
            'name' => [$std, '前三', '组三直选'],
            'tags' => [
                ['nm' => '二重号', 'sv' => $b19, 'vv' => $b19],
                ['nm' => '单号', 'sv' => $b19, 'vv' => $b19],
            ],
    ],

    55 => [
            'name' => [$std, '前三', '组六包号'],
            'tags' => [
                ['nm' => '包号', 'sv' => $b19, 'vv' => $b19],
            ],
    ],

    56 => [
            'name' => [$std, '前三', '前三豹子'],
            'tags' => [
                ['nm' => '豹子通选', 'sv' => ['豹子通选'], 'vv' => ['豹子通选']],
                ['nm' => '豹子单选', 'sv' => ['000', '111', '222', '333', '444', '555', '666', '777', '888', '999'], 'vv' => ['000', '111', '222', '333', '444', '555', '666', '777', '888', '999']],
            ],
    ],

    57 => [
            'name' => [$std, '前三', '前三顺子'],
            'tags' => [
                ['nm' => '顺子通选', 'sv' => ['顺子通选'], 'vv' => ['顺子通选']],
                ['nm' => '顺子单选', 'sv' => ['012', '123', '234', '345', '456', '567', '678', '789', '890', '901'], 'vv' => ['012', '123', '234', '345', '456', '567', '678', '789', '890', '901']],
            ],
    ],

    58 => [
            'name' => [$std, '前三', '前三对子'],
            'tags' => [
                ['nm' => '对子通选', 'sv' => ['对子通选'], 'vv' => ['对子通选']],
                ['nm' => '对子单选', 'sv' => ['00', '11', '22', '33', '44', '55', '66', '77', '88', '99'], 'vv' => ['00', '11', '22', '33', '44', '55', '66', '77', '88', '99']],
            ],
    ],*/

    59 => [
            'name' => [$std, '前二', '直选复式'],
            'tags' => [
                ['nm' => $shi_wei, 'sv' => $b19, 'vv' => $b19],
                ['nm' => $ge_wei, 'sv' => $b19, 'vv' => $b19],
            ],
    ],

    /*60 => [
            'name' => [$std, '后二', '直选和值'],
            'tags' => [
                ['nm' => '和值', 'sv' => $b18, 'vv' => $b18],
            ],
    ],

    61 => [
            'name' => [$std, '后二', '直选跨度'],
            'tags' => [
                ['nm' => '跨度', 'sv' => $b19, 'vv' => $b19],
            ],
    ],

    62 => [
            'name' => [$std, '后二', '组选复式'],
            'tags' => [
                ['nm' => '组选', 'sv' => $b19, 'vv' => $b19],
            ],
    ],*/

    63 => [
            'name' => [$std, '后二', '直选复式'],
            'tags' => [
                ['nm' => $wan_wei, 'sv' => $b19, 'vv' => $b19],
                ['nm' => $qian_wei, 'sv' => $b19, 'vv' => $b19],
            ],
    ],

   /* 64 => [
            'name' => [$std, '前二', '直选和值'],
            'tags' => [
                ['nm' => '和值', 'sv' => $b18, 'vv' => $b18],
            ],
    ],

    65 => [
            'name' => [$std, '前二', '直选跨度'],
            'tags' => [
                ['nm' => '跨度', 'sv' => $b19, 'vv' => $b19],
            ],
    ],

    66 => [
            'name' => [$std, '前二', '组选复式'],
            'tags' => [
                ['nm' => '组选', 'sv' => $b19, 'vv' => $b19],
            ],
    ],

    67 => [
            'name' => ['快捷', '两面', '龙虎斗'],
            'tags' => [
                ['nm' => '万位vs千位', 'sv' => ['龙', '虎', '合'], 'vv' => ['万千龙', '万千虎', '万千合']],
                ['nm' => '万位vs百位', 'sv' => ['龙', '虎', '合'], 'vv' => ['万百龙', '万百虎', '万百合']],
                ['nm' => '万位vs十位', 'sv' => ['龙', '虎', '合'], 'vv' => ['万十龙', '万十虎', '万十合']],
                ['nm' => '万位vs个位', 'sv' => ['龙', '虎', '合'], 'vv' => ['万个龙', '万个虎', '万个合']],
                ['nm' => '千位vs百位', 'sv' => ['龙', '虎', '合'], 'vv' => ['千百龙', '千百虎', '千百合']],
                ['nm' => '千位vs十位', 'sv' => ['龙', '虎', '合'], 'vv' => ['千十龙', '千十虎', '千十合']],
                ['nm' => '千位vs个位', 'sv' => ['龙', '虎', '合'], 'vv' => ['千个龙', '千个虎', '千个合']],
                ['nm' => '百位vs十位', 'sv' => ['龙', '虎', '合'], 'vv' => ['百十龙', '百十虎', '百十合']],
                ['nm' => '百位vs个位', 'sv' => ['龙', '虎', '合'], 'vv' => ['百个龙', '百个虎', '百个合']],
                ['nm' => '十位vs个位', 'sv' => ['龙', '虎', '合'], 'vv' => ['十个龙', '十个虎', '十个合']],
            ],
    ],

    68 => [
            'name' => ['快捷', '两面', '五字和'],
            'tags' => [
                ['nm' => '和数', 'sv' => ['大', '小', '单', '双'], 'vv' => ['总数大', '总数小', '总数单', '总数双']],
                ['nm' => '和数尾', 'sv' => ['大', '小', '质', '合'], 'vv' => ['和尾数大', '和尾数小', '和尾数质', '和尾数合']],
            ],
    ],

    69 => [
            'name' => ['快捷', '定位胆', '球号'],
            'tags' => [
                ['nm' => $wan_wei, 'sv' => $b19, 'vv' => $b19],
                ['nm' => $qian_wei, 'sv' => $b19, 'vv' => $b19],
                ['nm' => $bai_wei, 'sv' => $b19, 'vv' => $b19],
                ['nm' => $shi_wei, 'sv' => $b19, 'vv' => $b19],
                ['nm' => $ge_wei, 'sv' => $b19, 'vv' => $b19]
            ],
    ],

    70 => [
            'name' => [$std, $no_positioning, '后三一码'],
            'tags' => [
                ['nm' => $no_positioning, 'sv' => $b19, 'vv' => $b19],
            ],
    ],

    71 => [
            'name' => ['快捷', $no_positioning, '中三一码'],
            'tags' => [
                ['nm' => $no_positioning, 'sv' => $b19, 'vv' => $b19],
            ],
    ],*/

    72 => [
            'name' => [$std, '前三', '三中一'],
            'tags' => [
                ['nm' => $no_positioning, 'sv' => $b19, 'vv' => $b19],
            ],
    ],
/*
    73 => [
            'name' => ['快捷', $no_positioning, '后三二码'],
            'tags' => [
                ['nm' => $no_positioning, 'sv' => $b19, 'vv' => $b19],
            ],
    ],

    74 => [
            'name' => ['快捷', $no_positioning, '中三二码'],
            'tags' => [
                ['nm' => $no_positioning, 'sv' => $b19, 'vv' => $b19],
            ],
    ],

    75 => [
            'name' => ['快捷', $no_positioning, '前三二码'],
            'tags' => [
                ['nm' => $no_positioning, 'sv' => $b19, 'vv' => $b19],
            ],
    ],

    76 => [
            'name' => ['快捷', $no_positioning, '后四一码'],
            'tags' => [
                ['nm' => $no_positioning, 'sv' => $b19, 'vv' => $b19],
            ],
    ],

    77 => [
            'name' => ['快捷', $no_positioning, '后四二码'],
            'tags' => [
                ['nm' => $no_positioning, 'sv' => $b19, 'vv' => $b19],
            ],
    ],

    78 => [
            'name' => ['快捷', $no_positioning, '五星二码'],
            'tags' => [
                ['nm' => $no_positioning, 'sv' => $b19, 'vv' => $b19],
            ],
    ],

    79 => [
            'name' => ['快捷', $no_positioning, '五星三码'],
            'tags' => [
                ['nm' => $no_positioning, 'sv' => $b19, 'vv' => $b19],
            ],
    ],

    80 => [
            'name' => ['快捷', '大小单双', '单球'],
            'tags' => [
                ['nm' => $wan_wei, 'sv' => $bbd, 'vv' => $bbd],
                ['nm' => $qian_wei, 'sv' => $bbd, 'vv' => $bbd],
                ['nm' => $bai_wei, 'sv' => $bbd, 'vv' => $bbd],
                ['nm' => $shi_wei, 'sv' => $bbd, 'vv' => $bbd],
                ['nm' => $ge_wei, 'sv' => $bbd, 'vv' => $bbd]
            ],
    ],

    81 => [
            'name' => ['快捷', '大小单双', '后二'],
            'tags' => [
                ['nm' => $shi_wei, 'sv' => $bbd, 'vv' => $bbd],
                ['nm' => $ge_wei, 'sv' => $bbd, 'vv' => $bbd]
            ],
    ],

    82 => [
            'name' => ['快捷', '大小单双', '前二'],
            'tags' => [
                ['nm' => $wan_wei, 'sv' => $bbd, 'vv' => $bbd],
                ['nm' => $qian_wei, 'sv' => $bbd, 'vv' => $bbd]
            ],
    ],

    83 => [
            'name' => ['快捷', '大小单双', '后三'],
            'tags' => [
                ['nm' => $bai_wei, 'sv' => $bbd, 'vv' => $bbd],
                ['nm' => $shi_wei, 'sv' => $bbd, 'vv' => $bbd],
                ['nm' => $ge_wei, 'sv' => $bbd, 'vv' => $bbd]
            ],
    ],

    84 => [
            'name' => ['快捷', '大小单双', '前三'],
            'tags' => [
                ['nm' => $wan_wei, 'sv' => $bbd, 'vv' => $bbd],
                ['nm' => $qian_wei, 'sv' => $bbd, 'vv' => $bbd],
                ['nm' => $bai_wei, 'sv' => $bbd, 'vv' => $bbd]
            ],
    ],*/

    85 => [
        'name' => [$std, '前三', '前三组选'],
        'tags' => [
            ['nm' => $bai_wei, 'sv' => $b19, 'vv' => $b19],
            ['nm' => $shi_wei, 'sv' => $b19, 'vv' => $b19],
            ['nm' => $ge_wei, 'sv' => $b19, 'vv' => $b19]
        ],
    ],

    //后二中一码
    86 => [
        'name' => [$std, '后二', '二中一'],
        'tags' => [
            ['nm' => $no_positioning, 'sv' => $b19, 'vv' => $b19],
        ],
    ],
];
