<?php
/**
 * Created by PhpStorm.
 * User: Nico
 * Date: 2018/7/4
 * Time: 10:30
 */
$b49 = ['01','02','03','04','05','06','07','08','09','10','11','12','13','14','15','16','17','18','19','20','21','22','23','24','25','26','27','28','29','30','31','32','33','34','35','36','37','38','39','40','41','42','43','44','45','46','47','48','49'];
$sx = ['鼠','牛','虎','兔','龙','蛇','马','羊','猴','鸡','狗','猪'];//生肖
$sb = ['红波','蓝波','绿波'];
$dxds = ['大','小','单','双', '小单','小双','大单','大双'];
$hs = ['和大','和小','和单','和双'];
$ws = ['尾大','尾小'];

return [
    510=>[
        'aliasName'  => '特码号',
        'playId' => 510,
        'tags' => [
            ['nm' => '球号', 'sv' => $b49, 'vv' => $b49],
        ],
    ],
    511=>[
        'aliasName'  => '特码双面',
        'playId' => 511,
        'tags' => [
            ['nm' => '大小单双', 'sv' => $dxds, 'vv' => $dxds,
            ['nm' => '和数','sv' => $hs, 'vv' => $hs],
            ['nm' => '尾数','sv' => $ws,'vv'=>$ws]
            ],
        ],
    ],

    512=>[
        'aliasName'  => '正码号',
        'playId' => 512,
        'tags' => [
            ['nm' => '球号', 'sv' => $b49, 'vv' => $b49],
        ],
    ],
    513=>[
        'aliasName'  => '特码生肖',
        'playId' => 513,
        'tags' => [
            ['nm' => '生肖', 'sv' => $sx, 'vv' => $sx],
        ],
    ],
    514=>[
        'aliasName'  => '正码生肖',
        'playId' => 514,
        'tags' => [
            ['nm' => '生肖', 'sv' => $sx, 'vv' => $sx],
        ],
    ],
    515=>[
        'aliasName'  => '正特生肖',
        'playId' => 515,
        'tags' => [
            ['nm' => '生肖', 'sv' => $sx, 'vv' => $sx],
        ],
    ],
    516=>[
        'aliasName'  => '特码色波',
        'playId' => 516,
        'tags' => [
            ['nm' => '色波', 'sv' => $sb, 'vv' => $sb],
        ],
    ],
    517=>[
        'aliasName'  => '特码半波',
        'playId' => 517,
        'tags' => [
            ['nm' => '半波',
                'sv' => ['红单','红双','红大','红小','蓝单','蓝双','蓝大','蓝小','绿单','绿双','绿大','绿小'],
                'vv' => ['红单','红双','红大','红小','蓝单','蓝双','蓝大','蓝小','绿单','绿双','绿大','绿小']
            ],
        ],
    ],
    518=>[
        'aliasName'  => '特码三波',
        'playId' => 518,
        'tags' => [
            ['nm' => '三波',
                'sv' => ['红大单','红大双','红小单','红小双','蓝大单','蓝大双','蓝小单','蓝小双','绿大单','绿大双','绿小单','绿小双'],
                'vv' => ['红大单','红大双','红小单','红小双','蓝大单','蓝大双','蓝小单','蓝小双','绿大单','绿大双','绿小单','绿小双']
            ],
        ],
    ],
    519=>[
        'aliasName'  => '特码头数',
        'playId' => 519,
        'tags' => [
            ['nm' => '头数',
                'sv' => ['头0','头1','头2','头3','头4'],
                'vv' => ['头0','头1','头2','头3','头4']
            ],
        ],
    ],
    520=>[
        'aliasName'  => '特码尾数',
        'playId' => 520,
        'tags' => [
            ['nm' => '尾数',
                'sv' => ['尾0','尾1','尾2','尾3','尾4','尾5','尾6','尾7','尾8','尾9'],
                'vv' => ['尾0','尾1','尾2','尾3','尾4','尾5','尾6','尾7','尾8','尾9']
            ],
        ],
    ],
    521=>[
        'aliasName'  => '正码尾数',
        'playId' => 521,
        'tags' => [
            ['nm' => '尾数',
                'sv' => ['尾0','尾1','尾2','尾3','尾4','尾5','尾6','尾7','尾8','尾9'],
                'vv' => ['尾0','尾1','尾2','尾3','尾4','尾5','尾6','尾7','尾8','尾9']
            ],
        ],
    ],
    522=>[
        'aliasName'  => '正码一',
        'playId' => 522,
        'tags' => [
            ['nm' => '球号', 'sv' => $b49, 'vv' => $b49],
        ],
    ],
    523=>[
        'aliasName'  => '正码二',
        'playId' => 523,
        'tags' => [
            ['nm' => '球号', 'sv' => $b49, 'vv' => $b49],
        ],
    ],
    524=>[
        'aliasName'  => '正码三',
        'playId' => 524,
        'tags' => [
            ['nm' => '球号', 'sv' => $b49, 'vv' => $b49],
        ],
    ],
    525=>[
        'aliasName'  => '正码四',
        'playId' => 525,
        'tags' => [
            ['nm' => '球号', 'sv' => $b49, 'vv' => $b49],
        ],
    ],
    526=>[
        'aliasName'  => '正码五',
        'playId' => 526,
        'tags' => [
            ['nm' => '球号', 'sv' => $b49, 'vv' => $b49],
        ],
    ],
    527=>[
        'aliasName'  => '正码六',
        'playId' => 527,
        'tags' => [
            ['nm' => '球号', 'sv' => $b49, 'vv' => $b49],
        ],
    ],
    528=>[
        'aliasName'  => '正码一',
        'playId' => 528,
        'tags' => [
            ['nm' => '大小单双', 'sv' => $dxds, 'vv' => $dxds,
                ['nm' => '和数','sv' => $hs, 'vv' => $hs],
                ['nm' => '尾数','sv' => $ws,'vv'=>$ws],
                ['nm'=> '色波','sv'=> $sb,'vv'=>$sb],
            ],
        ],
    ],
    529=>[
        'aliasName'  => '正码二',
        'playId' => 529,
        'tags' => [
            ['nm' => '大小单双', 'sv' => $dxds, 'vv' => $dxds,
                ['nm' => '和数','sv' => $hs, 'vv' => $hs],
                ['nm' => '尾数','sv' => $ws,'vv'=>$ws],
                ['nm'=> '色波','sv'=> $sb,'vv'=>$sb],
            ],
        ],
    ],
    530=>[
        'aliasName'  => '正码三',
        'playId' => 530,
        'tags' => [
            ['nm' => '大小单双', 'sv' => $dxds, 'vv' => $dxds,
                ['nm' => '和数','sv' => $hs, 'vv' => $hs],
                ['nm' => '尾数','sv' => $ws,'vv'=>$ws],
                ['nm'=> '色波','sv'=> $sb,'vv'=>$sb],
            ],
        ],
    ],
    531=>[
        'aliasName'  => '正码四',
        'playId' => 531,
        'tags' => [
            ['nm' => '大小单双', 'sv' => $dxds, 'vv' => $dxds,
                ['nm' => '和数','sv' => $hs, 'vv' => $hs],
                ['nm' => '尾数','sv' => $ws,'vv'=>$ws],
                ['nm'=> '色波','sv'=> $sb,'vv'=>$sb],
            ],
        ],
    ],
    532=>[
        'aliasName'  => '正码五',
        'playId' => 532,
        'tags' => [
            ['nm' => '大小单双', 'sv' => $dxds, 'vv' => $dxds,
                ['nm' => '和数','sv' => $hs, 'vv' => $hs],
                ['nm' => '尾数','sv' => $ws,'vv'=>$ws],
                ['nm'=> '色波','sv'=> $sb,'vv'=>$sb],
            ],
        ],
    ],
    533=>[
        'aliasName'  => '正码六',
        'playId' => 533,
        'tags' => [
            ['nm' => '大小单双', 'sv' => $dxds, 'vv' => $dxds,
                ['nm' => '和数','sv' => $hs, 'vv' => $hs],
                ['nm' => '尾数','sv' => $ws,'vv'=>$ws],
                ['nm'=> '色波','sv'=> $sb,'vv'=>$sb],
            ],
        ],
    ],
    534=>[
        'aliasName'  => '五中一',
        'playId' => 534,
        'tags' => [
            ['nm' => '球号', 'sv' => $b49, 'vv' => $b49],
        ],
    ],
    535=>[
        'aliasName'  => '六中一',
        'playId' => 535,
        'tags' => [
            ['nm' => '球号', 'sv' => $b49, 'vv' => $b49],
        ],
    ],
    536=>[
        'aliasName'  => '七中一',
        'playId' => 536,
        'tags' => [
            ['nm' => '球号', 'sv' => $b49, 'vv' => $b49],
        ],
    ],
    537=>[
        'aliasName'  => '八中一',
        'playId' => 537,
        'tags' => [
            ['nm' => '球号', 'sv' => $b49, 'vv' => $b49],
        ],
    ],
    538=>[
        'aliasName'  => '九中一',
        'playId' => 538,
        'tags' => [
            ['nm' => '球号', 'sv' => $b49, 'vv' => $b49],
        ],
    ],
    539=>[
        'aliasName'  => '十中一',
        'playId' => 539,
        'tags' => [
            ['nm' => '球号', 'sv' => $b49, 'vv' => $b49],
        ],
    ],
    540=>[
        'aliasName'  => '五不中',
        'playId' => 540,
        'tags' => [
            ['nm' => '球号', 'sv' => $b49, 'vv' => $b49],
        ],
    ],
    541=>[
        'aliasName'  => '六不中',
        'playId' => 541,
        'tags' => [
            ['nm' => '球号', 'sv' => $b49, 'vv' => $b49],
        ],
    ],
    542=>[
        'aliasName'  => '七不中',
        'playId' => 542,
        'tags' => [
            ['nm' => '球号', 'sv' => $b49, 'vv' => $b49],
        ],
    ],
    543=>[
        'aliasName'  => '八不中',
        'playId' => 453,
        'tags' => [
            ['nm' => '球号', 'sv' => $b49, 'vv' => $b49],
        ],
    ],
    544=>[
        'aliasName'  => '九不中',
        'playId' => 544,
        'tags' => [
            ['nm' => '球号', 'sv' => $b49, 'vv' => $b49],
        ],
    ],
    545=>[
        'aliasName'  => '十不中',
        'playId' => 545,
        'tags' => [
            ['nm' => '球号', 'sv' => $b49, 'vv' => $b49],
        ],
    ],
    546=>[
        'aliasName'  => '三中二',
        'playId' => 546,
        'tags' => [
            ['nm' => '球号', 'sv' => $b49, 'vv' => $b49],
        ],
    ],
    547=>[
        'aliasName'  => '三全中',
        'playId' => 547,
        'tags' => [
            ['nm' => '球号', 'sv' => $b49, 'vv' => $b49],
        ],
    ],
    548=>[
        'aliasName'  => '二全中',
        'playId' => 548,
        'tags' => [
            ['nm' => '球号', 'sv' => $b49, 'vv' => $b49],
        ],
    ],
    549=>[
        'aliasName'  => '二中特',
        'playId' => 549,
        'tags' => [
            ['nm' => '球号', 'sv' => $b49, 'vv' => $b49],
        ],
    ],
    550=>[
        'aliasName'  => '特串',
        'playId' => 550,
        'tags' => [
            ['nm' => '球号', 'sv' => $b49, 'vv' => $b49],
        ],
    ],
    //2019-12-21 add
    551=>[
        'aliasName'  => '二连肖',
        'playId' => 551,
        'tags' => [
            ['nm' => '生肖', 'sv' => $sx, 'vv' => $sx],
        ],
    ],
    552=>[
        'aliasName'  => '三连肖',
        'playId' => 552,
        'tags' => [
            ['nm' => '生肖', 'sv' => $sx, 'vv' => $sx],
        ],
    ],
    553=>[
        'aliasName'  => '三连肖',
        'playId' => 553,
        'tags' => [
            ['nm' => '生肖', 'sv' => $sx, 'vv' => $sx],
        ],
    ],
    554=>[
        'aliasName'  => '四连肖',
        'playId' => 554,
        'tags' => [
            ['nm' => '生肖', 'sv' => $sx, 'vv' => $sx],
        ],
    ],
];