<?php
//801 - 950
$b111 = ['01', '02', '03', '04', '05', '06', '07', '08', '09', '10', '11'];
$b111v = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11];
$bbd = ['大', '小', '单', '双'];
$bld = ['龙', '虎'];
return [
    801 => [
            'name' => ['标准', '前三码', '直选复式'],
            'tags' => [
                ['nm' => '第一球', 'sv' => $b111, 'vv' => $b111v],
                ['nm' => '第二球', 'sv' => $b111, 'vv' => $b111v],
                ['nm' => '第三球', 'sv' => $b111, 'vv' => $b111v],
            ],
    ],

    802 => [
            'name' => ['标准', '前三码', '组选复式'],
            'tags' => [
                ['nm' => '组选', 'sv' => $b111, 'vv' => $b111v],
            ],
    ],

    803 => [
            'name' => ['标准', '前三码', '组选胆拖'],
            'tags' => [
                ['nm' => '胆码', 'sv' => $b111, 'vv' => $b111v],
                ['nm' => '拖码', 'sv' => $b111, 'vv' => $b111v],
            ],
    ],

    804 => [
            'name' => ['标准', '前二码', '直选复式'],
            'tags' => [
                ['nm' => '第一球', 'sv' => $b111, 'vv' => $b111v],
                ['nm' => '第二球', 'sv' => $b111, 'vv' => $b111v],
            ],
    ],

    805 => [
            'name' => ['标准', '前二码', '组选复式'],
            'tags' => [
                ['nm' => '组选', 'sv' => $b111, 'vv' => $b111v],
            ],
    ],

    806 => [
            'name' => ['标准', '前二码', '组选胆拖'],
            'tags' => [
                ['nm' => '胆码', 'sv' => $b111, 'vv' => $b111v],
                ['nm' => '拖码', 'sv' => $b111, 'vv' => $b111v],
            ],
    ],

    807 => [
            'name' => ['标准', '任选复式', '1中1复式'],
            'tags' => [
                ['nm' => '选一中一', 'sv' => $b111, 'vv' => $b111v],
            ],
    ],

    808 => [
            'name' => ['标准', '任选复式', '2中2复式'],
            'tags' => [
                ['nm' => '选二中二', 'sv' => $b111, 'vv' => $b111v],
            ],
    ],

    809 => [
            'name' => ['标准', '任选复式', '3中3复式'],
            'tags' => [
                ['nm' => '选三中三', 'sv' => $b111, 'vv' => $b111v],
            ],
    ],

    810 => [
            'name' => ['标准', '任选复式', '4中4复式'],
            'tags' => [
                ['nm' => '选四中四', 'sv' => $b111, 'vv' => $b111v],
            ],
    ],

    811 => [
            'name' => ['标准', '任选复式', '5中5复式'],
            'tags' => [
                ['nm' => '选五中五', 'sv' => $b111, 'vv' => $b111v],
            ],
    ],

    812 => [
            'name' => ['标准', '任选复式', '6中5复式'],
            'tags' => [
                ['nm' => '选六中五', 'sv' => $b111, 'vv' => $b111v],
            ],
    ],

    813 => [
            'name' => ['标准', '任选复式', '7中5复式'],
            'tags' => [
                ['nm' => '选七中五', 'sv' => $b111, 'vv' => $b111v],
            ],
    ],

    814 => [
            'name' => ['标准', '任选复式', '8中5复式'],
            'tags' => [
                ['nm' => '选八中五', 'sv' => $b111, 'vv' => $b111v],
            ],
    ],

    815 => [
            'name' => ['标准', '任选胆拖', '2中2胆拖'],
            'tags' => [
                ['nm' => '胆码', 'sv' => $b111, 'vv' => $b111v],
                ['nm' => '拖码', 'sv' => $b111, 'vv' => $b111v],
            ],
    ],

    816 => [
            'name' => ['标准', '任选胆拖', '3中3胆拖'],
            'tags' => [
                ['nm' => '胆码', 'sv' => $b111, 'vv' => $b111v],
                ['nm' => '拖码', 'sv' => $b111, 'vv' => $b111v],
            ],
    ],

    817 => [
            'name' => ['标准', '任选胆拖', '4中4胆拖'],
            'tags' => [
                ['nm' => '胆码', 'sv' => $b111, 'vv' => $b111v],
                ['nm' => '拖码', 'sv' => $b111, 'vv' => $b111v],
            ],
    ],

    818 => [
            'name' => ['标准', '任选胆拖', '5中5胆拖'],
            'tags' => [
                ['nm' => '胆码', 'sv' => $b111, 'vv' => $b111v],
                ['nm' => '拖码', 'sv' => $b111, 'vv' => $b111v],
            ],
    ],

    819 => [
            'name' => ['标准', '任选胆拖', '6中5胆拖'],
            'tags' => [
                ['nm' => '胆码', 'sv' => $b111, 'vv' => $b111v],
                ['nm' => '拖码', 'sv' => $b111, 'vv' => $b111v],
            ],
    ],

    820 => [
            'name' => ['标准', '任选胆拖', '7中5胆拖'],
            'tags' => [
                ['nm' => '胆码', 'sv' => $b111, 'vv' => $b111v],
                ['nm' => '拖码', 'sv' => $b111, 'vv' => $b111v],
            ],
    ],

    821 => [
            'name' => ['标准', '任选胆拖', '8中5胆拖'],
            'tags' => [
                ['nm' => '胆码', 'sv' => $b111, 'vv' => $b111v],
                ['nm' => '拖码', 'sv' => $b111, 'vv' => $b111v],
            ],
    ],

    822 => [
            'name' => ['快捷', '定位', '定位球号'],
            'tags' => [
                ['nm' => '第一球', 'sv' => $b111, 'vv' => $b111v],
                ['nm' => '第二球', 'sv' => $b111, 'vv' => $b111v],
                ['nm' => '第三球', 'sv' => $b111, 'vv' => $b111v],
                ['nm' => '第四球', 'sv' => $b111, 'vv' => $b111v],
                ['nm' => '第五球', 'sv' => $b111, 'vv' => $b111v],
            ],
    ],

    823 => [
            'name' => ['快捷', '定位', '大小单双'],
            'tags' => [
                ['nm' => '第一球', 'sv' => $bbd, 'vv' => $bbd],
                ['nm' => '第二球', 'sv' => $bbd, 'vv' => $bbd],
                ['nm' => '第三球', 'sv' => $bbd, 'vv' => $bbd],
                ['nm' => '第四球', 'sv' => $bbd, 'vv' => $bbd],
                ['nm' => '第五球', 'sv' => $bbd, 'vv' => $bbd],
            ],
    ],

    824 => [
            'name' => ['快捷', '不定位', '不定位码'],
            'tags' => [
                ['nm' => '前三位', 'sv' => $b111, 'vv' => $b111v],
            ],
    ],

    825 => [
            'name' => ['快捷', '趣味玩法', '龙虎斗'],
            'tags' => [
                ['nm' => '一球vs五球', 'sv' => $bld, 'vv' => ['一五龙', '一五虎']],
                ['nm' => '二球vs四球', 'sv' => $bld, 'vv' => ['二四龙', '二四虎']],
            ],
    ],

    826 => [
            'name' => ['快捷', '趣味玩法', '定向单双'],
            'tags' => [
                ['nm' => '定向单双', 'sv' => ['5单0双', '4单1双', '3单2双', '2单3双', '1单4双', '0单5双'], 'vv' => ['5单0双', '4单1双', '3单2双', '2单3双', '1单4双', '0单5双']],
            ],
    ],

    827 => [
            'name' => ['快捷', '趣味玩法', '定向中位'],
            'tags' => [
                ['nm' => '猜中位', 'sv' => ['03','04','05','06','07','08','09'], 'vv' => ['3','4','5','6','7','8','9']],
            ],
            'standardOddsDesc' => ['3','4','5','6','7','8','9'],
    ],
];
