<?php
return [
    'noWhitespace' => '{{name}} रिक्त स्थान नहीं हो सकते',
    'length' => '{{name}}लंबाई होनी चाहिए {{minValue}} और {{maxValue}}',
    'notEmpty' => '{{name}} खाली मूल्यों की अनुमति नहीं देता है',
    'arrayType' => '{{name}} एक सरणी होनी चाहिए',
    'alnum' => '{{name}} अक्षरों (a-z) या संख्याओं (0-9) का उपयोग करना चाहिए',
    'numeric' => '{{name}} संख्यात्मक प्रकार का होना चाहिए',
    'floatVal' => '{{name}} फ़्लोटिंग पॉइंट प्रकार होना चाहिए',
    'floatType' => '{{name}} फ़्लोटिंग पॉइंट प्रकार होना चाहिए',
    'between' => '{{name}} अंतराल है {{min}} - {{max}}',
    'date' => '{{name}} दिनांक प्रकार का होना चाहिए',
    'intVal' => '{{name}} पूर्णांक होना चाहिए',
    'arrayVal' => '{{name}} एक सरणी प्रकार होना चाहिए',
    'age' => '{{name}} गलत है ',
    'email' => '{{name}} स्वरूप गलत है',
];